tests/performance/load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Ramp up"
    - duration: 180
      arrivalRate: 50
      name: "Load test"
    - duration: 120
      arrivalRate: 100
      name: "Stress test"
    - duration: 60
      arrivalRate: 20
      name: "Cool down"
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./performance-processor.js"

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Get Circle List"
    weight: 30
    flow:
      - get:
          url: "/api/v1/circles?limit=10&offset=0"
          expect:
            - statusCode: 200
            - contentType: json

  - name: "Get Circle by ID"
    weight: 25
    flow:
      - get:
          url: "/api/v1/circles/{{ $randomNumber(1, 100) }}"

  - name: "Search Circles"
    weight: 20
    flow:
      - get:
          url: "/api/v1/circles/search?q={{ randomSearchTerm }}"
          beforeRequest: "generateSearchTerm"

  - name: "Get Trending Circles"
    weight: 15
    flow:
      - get:
          url: "/api/v1/circles/trending?limit=10"
          expect:
            - statusCode: 200

  - name: "Get Token Balance"
    weight: 15
    flow:
      - get:
          url: "/api/v1/trading/balance/{{ $randomNumber(1, 50) }}/{{ randomAddress }}"
          beforeRequest: "generateAddress"

  - name: "Get Token Price"
    weight: 15
    flow:
      - get:
          url: "/api/v1/trading/price/{{ $randomNumber(1, 50) }}"

  - name: "Create Circle (Heavy)"
    weight: 5
    flow:
      - post:
          url: "/api/v1/circles"
          json:
            name: "{{ randomCircleName }}"
            symbol: "{{ randomSymbol }}"
            description: "{{ randomDescription }}"
            curve_type: 0
            base_price: "1000000000000000"
            k: "1000000000000000"
            private_key: "{{ testPrivateKey }}"
          beforeRequest: "generateCircleData"
          capture:
            - json: "$.tx_hash"
              as: "txHash"

# Performance expectations
expect:
  thresholds:
    http.response_time:
      p95: 200  # 95% of requests should complete within 200ms
      p99: 500  # 99% of requests should complete within 500ms
    http.request_rate:
      min: 50   # Minimum 50 requests per second
    http.errors:
      max: 0.01 # Error rate should be less than 1%

# Metrics collection
plugins:
  expect: {}
  metrics-by-endpoint: {}